<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"210bd3dfe89d5168f4d6660ac7cac378f9c3edc21cde7271f86677bfa8628d16","plan_job_ref":"Job Environment Main - Plan #1861 at https://github.com/jarrod-lowe/wildsea/actions/runs/18235615492","plan_out_hash":"7b50cbd490c6cee6733763d1649907f9ccbab59e52c4d9708f3d61e904949e1e","plan_hash":"6f5ab1b1c3e4ca5b0052e24a3f2da2693071cf4c8d527b89bb37fc6084996c4b","plan_text_format":"diff","version":"2.2.2"} -->
Terraform plan in __terraform/environment/wildsea__
With backend config: `bucket=terraform-state-021891603679 key=primary/terraform.tfstate region=ap-southeast-2`<details open><summary>With variables</summary>

```hcl
domain_name          = "wildsea.lowe.kiwi"
environment          = "primary"
google_client_id     = (sensitive value)
google_client_secret = (sensitive value)
saml_metadata_url    = (sensitive value)
sns_alarm_topic_arn  = "arn:aws:sns:ap-southeast-2:453430506965:Pushover"
```
</details>
<details>
<summary>Plan: 3 to add, 6 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.wildsea.data.aws_iam_policy_document.asset_uploads_pipe will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "asset_uploads_pipe" {
+       id            = (known after apply)
+       json          = (known after apply)
+       minified_json = (known after apply)

+       statement {
+           actions   = [
+               "sqs:DeleteMessage",
+               "sqs:GetQueueAttributes",
+               "sqs:ReceiveMessage",
            ]
+           effect    = "Allow"
+           resources = [
+               "arn:aws:sqs:ap-southeast-2:021891603679:Wildsea-primary-asset-uploads",
            ]
        }
+       statement {
+           actions   = [
+               "states:StartSyncExecution",
            ]
+           effect    = "Allow"
+           resources = [
+               "arn:aws:states:ap-southeast-2:021891603679:stateMachine:Wildsea-primary-asset-path-parser",
            ]
        }
+       statement {
+           actions   = [
+               "events:PutEvents",
            ]
+           effect    = "Allow"
+           resources = [
+               "arn:aws:events:ap-southeast-2:021891603679:event-bus/Wildsea-primary",
            ]
        }
+       statement {
+           actions   = [
+               "logs:CreateLogStream",
+               "logs:PutLogEvents",
            ]
+           effect    = "Allow"
+           resources = [
+               (known after apply),
            ]
        }
    }

  # module.wildsea.data.aws_iam_policy_document.delete_player_pipe will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "delete_player_pipe" {
+       id            = (known after apply)
+       json          = (known after apply)
+       minified_json = (known after apply)

+       statement {
+           actions   = [
+               "dynamodb:DescribeStream",
+               "dynamodb:GetRecords",
+               "dynamodb:GetShardIterator",
+               "dynamodb:ListStreams",
            ]
+           resources = [
+               "arn:aws:dynamodb:ap-southeast-2:021891603679:table/Wildsea-primary/stream/2025-09-28T02:27:27.095",
            ]
+           sid       = "ReadStream"
        }
+       statement {
+           actions   = [
+               "states:StartExecution",
            ]
+           resources = [
+               "arn:aws:states:ap-southeast-2:021891603679:stateMachine:Wildsea-primary-delete-player",
            ]
+           sid       = "InvokeStepFunction"
        }
+       statement {
+           actions   = [
+               "logs:CreateLogStream",
+               "logs:PutLogEvents",
            ]
+           resources = [
+               (known after apply),
            ]
+           sid       = "WriteLogs"
        }
    }

  # module.wildsea.data.aws_iam_policy_document.expire_asset_pipe will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "expire_asset_pipe" {
+       id            = (known after apply)
+       json          = (known after apply)
+       minified_json = (known after apply)

+       statement {
+           actions   = [
+               "dynamodb:DescribeStream",
+               "dynamodb:GetRecords",
+               "dynamodb:GetShardIterator",
+               "dynamodb:ListStreams",
            ]
+           resources = [
+               "arn:aws:dynamodb:ap-southeast-2:021891603679:table/Wildsea-primary/stream/2025-09-28T02:27:27.095",
            ]
+           sid       = "ReadStream"
        }
+       statement {
+           actions   = [
+               "states:StartExecution",
            ]
+           resources = [
+               "arn:aws:states:ap-southeast-2:021891603679:stateMachine:Wildsea-primary-expire-asset",
            ]
+           sid       = "InvokeStepFunction"
        }
+       statement {
+           actions   = [
+               "logs:CreateLogStream",
+               "logs:PutLogEvents",
            ]
+           resources = [
+               (known after apply),
            ]
+           sid       = "WriteLogs"
        }
    }

  # module.wildsea.aws_cloudwatch_log_group.asset_uploads_pipe will be created
+   resource "aws_cloudwatch_log_group" "asset_uploads_pipe" {
+       arn               = (known after apply)
+       id                = (known after apply)
+       log_group_class   = (known after apply)
+       name              = "/aws/vendedlogs/pipes/Wildsea-primary-asset-uploads"
+       name_prefix       = (known after apply)
+       region            = "ap-southeast-2"
+       retention_in_days = 30
+       skip_destroy      = false
+       tags              = {
+           "Application" = "Wildsea-primary"
        }
+       tags_all          = {
+           "Application" = "Wildsea-primary"
        }
    }

  # module.wildsea.aws_cloudwatch_log_group.delete_player_pipe will be created
+   resource "aws_cloudwatch_log_group" "delete_player_pipe" {
+       arn               = (known after apply)
+       id                = (known after apply)
+       log_group_class   = (known after apply)
+       name              = "/aws/vendedlogs/pipes/Wildsea-primary-delete"
+       name_prefix       = (known after apply)
+       region            = "ap-southeast-2"
+       retention_in_days = 30
+       skip_destroy      = false
+       tags              = {
+           "Application" = "Wildsea-primary"
        }
+       tags_all          = {
+           "Application" = "Wildsea-primary"
        }
    }

  # module.wildsea.aws_cloudwatch_log_group.expire_asset_pipe will be created
+   resource "aws_cloudwatch_log_group" "expire_asset_pipe" {
+       arn               = (known after apply)
+       id                = (known after apply)
+       log_group_class   = (known after apply)
+       name              = "/aws/vendedlogs/pipes/Wildsea-primary-expire-asset"
+       name_prefix       = (known after apply)
+       region            = "ap-southeast-2"
+       retention_in_days = 30
+       skip_destroy      = false
+       tags              = {
+           "Application" = "Wildsea-primary"
        }
+       tags_all          = {
+           "Application" = "Wildsea-primary"
        }
    }

  # module.wildsea.aws_iam_policy.delete_player_pipe will be updated in-place
!~  resource "aws_iam_policy" "delete_player_pipe" {
        id               = "arn:aws:iam::021891603679:policy/Wildsea-primary-delete-pipe"
        name             = "Wildsea-primary-delete-pipe"
!~      policy           = jsonencode(
            {
-               Statement = [
-                   {
-                       Action   = [
-                           "dynamodb:ListStreams",
-                           "dynamodb:GetShardIterator",
-                           "dynamodb:GetRecords",
-                           "dynamodb:DescribeStream",
                        ]
-                       Effect   = "Allow"
-                       Resource = "arn:aws:dynamodb:ap-southeast-2:021891603679:table/Wildsea-primary/stream/2025-09-28T02:27:27.095"
-                       Sid      = "ReadStream"
                    },
-                   {
-                       Action   = "states:StartExecution"
-                       Effect   = "Allow"
-                       Resource = "arn:aws:states:ap-southeast-2:021891603679:stateMachine:Wildsea-primary-delete-player"
-                       Sid      = "InvokeStepFunction"
                    },
                ]
-               Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {}
#        (7 unchanged attributes hidden)
    }

  # module.wildsea.aws_iam_policy.expire_asset_pipe will be updated in-place
!~  resource "aws_iam_policy" "expire_asset_pipe" {
        id               = "arn:aws:iam::021891603679:policy/Wildsea-primary-expire-asset-pipe"
        name             = "Wildsea-primary-expire-asset-pipe"
!~      policy           = jsonencode(
            {
-               Statement = [
-                   {
-                       Action   = [
-                           "dynamodb:ListStreams",
-                           "dynamodb:GetShardIterator",
-                           "dynamodb:GetRecords",
-                           "dynamodb:DescribeStream",
                        ]
-                       Effect   = "Allow"
-                       Resource = "arn:aws:dynamodb:ap-southeast-2:021891603679:table/Wildsea-primary/stream/2025-09-28T02:27:27.095"
-                       Sid      = "ReadStream"
                    },
-                   {
-                       Action   = "states:StartExecution"
-                       Effect   = "Allow"
-                       Resource = "arn:aws:states:ap-southeast-2:021891603679:stateMachine:Wildsea-primary-expire-asset"
-                       Sid      = "InvokeStepFunction"
                    },
                ]
-               Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {}
#        (7 unchanged attributes hidden)
    }

  # module.wildsea.aws_iam_role_policy.asset_uploads_pipe will be updated in-place
!~  resource "aws_iam_role_policy" "asset_uploads_pipe" {
        id          = "Wildsea-primary-asset-uploads-pipe:Wildsea-primary-asset-uploads-pipe"
        name        = "Wildsea-primary-asset-uploads-pipe"
!~      policy      = jsonencode(
            {
-               Statement = [
-                   {
-                       Action   = [
-                           "sqs:ReceiveMessage",
-                           "sqs:GetQueueAttributes",
-                           "sqs:DeleteMessage",
                        ]
-                       Effect   = "Allow"
-                       Resource = "arn:aws:sqs:ap-southeast-2:021891603679:Wildsea-primary-asset-uploads"
                    },
-                   {
-                       Action   = "states:StartSyncExecution"
-                       Effect   = "Allow"
-                       Resource = "arn:aws:states:ap-southeast-2:021891603679:stateMachine:Wildsea-primary-asset-path-parser"
                    },
-                   {
-                       Action   = "events:PutEvents"
-                       Effect   = "Allow"
-                       Resource = "arn:aws:events:ap-southeast-2:021891603679:event-bus/Wildsea-primary"
                    },
                ]
-               Version   = "2012-10-17"
            }
        ) -> (known after apply)
#        (2 unchanged attributes hidden)
    }

  # module.wildsea.aws_pipes_pipe.asset_uploads_pipe will be updated in-place
!~  resource "aws_pipes_pipe" "asset_uploads_pipe" {
        id                 = "Wildsea-primary-asset-uploads"
        name               = "Wildsea-primary-asset-uploads"
        tags               = {
            "Application" = "Wildsea-primary"
        }
#        (11 unchanged attributes hidden)

+       log_configuration {
+           level = "ERROR"

+           cloudwatch_logs_log_destination {
+               log_group_arn = (known after apply)
            }
        }

#        (2 unchanged blocks hidden)
    }

  # module.wildsea.aws_pipes_pipe.delete_player_pipe will be updated in-place
!~  resource "aws_pipes_pipe" "delete_player_pipe" {
        id                 = "Wildsea-primary-delete"
        name               = "Wildsea-primary-delete"
        tags               = {}
#        (11 unchanged attributes hidden)

+       log_configuration {
+           level = "ERROR"

+           cloudwatch_logs_log_destination {
+               log_group_arn = (known after apply)
            }
        }

#        (2 unchanged blocks hidden)
    }

  # module.wildsea.aws_pipes_pipe.expire_asset_pipe will be updated in-place
!~  resource "aws_pipes_pipe" "expire_asset_pipe" {
        id                 = "Wildsea-primary-expire-asset"
        name               = "Wildsea-primary-expire-asset"
        tags               = {}
#        (11 unchanged attributes hidden)

+       log_configuration {
+           level = "ERROR"

+           cloudwatch_logs_log_destination {
+               log_group_arn = (known after apply)
            }
        }

#        (2 unchanged blocks hidden)
    }

Plan: 3 to add, 6 to change, 0 to destroy.

Warning: Invalid Attribute Combination

  with module.wildsea.aws_s3_bucket_lifecycle_configuration.assets_logs,
  on ../../module/wildsea/asset-bucket.tf line 111, in resource "aws_s3_bucket_lifecycle_configuration" "assets_logs":
 111: resource "aws_s3_bucket_lifecycle_configuration" "assets_logs" {

No attribute specified when one (and only one) of
[rule[0].filter,rule[0].prefix] is required

This will be an error in a future version of the provider

(and 2 more similar warnings elsewhere)

Warning: Deprecated attribute

  on ../../module/wildsea/deleter.tf line 9, in locals:
   9:     data.aws_region.current.name,

The attribute "name" is deprecated. Refer to the provider documentation for
details.

(and 7 more similar warnings elsewhere)
```
</details>

:memo: Plan generated in [Environment Main - Plan #1861](https://github.com/jarrod-lowe/wildsea/actions/runs/18235615492)